INSERT INTO USERS (EMAIL, NAME, PASSWORD)
VALUES ('user1@gmail.com', 'User1', 'password1'),
       ('user2@gmail.com', 'User2', 'password2'),
       ('user3@gmail.com', 'User3', 'password3'),
       ('admin@javaops.ru', 'Admin', 'admin');

INSERT INTO USER_ROLE (ROLE, USER_ID)
VALUES ('ROLE_USER', 1),
       ('ROLE_ADMIN', 2),
       ('ROLE_USER', 2);

INSERT INTO RESTAURANTS (NAME)
VALUES ('Печки-лавочки'),
       ('Суши-терра'),
       ('Дрова-мука');

INSERT INTO POSITIONS (DATE, DESCRIPTION, POSITION_TYPE, RESTAURANT_ID)
VALUES ('2022-01-01', 'Венегрет', 'LUNCH', 1),
       ('2022-01-01', 'Борщ', 'LUNCH', 1),
       ('2022-01-01', 'Картофельное пюре', 'LUNCH', 1),
       ('2022-01-01', 'Котлета по Киевски', 'LUNCH', 1),
       ('2022-01-01', 'Компот', 'LUNCH', 1),

       ('2022-01-01', 'Цезарь', 'LUNCH', 2),
       ('2022-01-01', 'Щи со свежей капустой', 'LUNCH', 2),
       ('2022-01-01', 'Рис', 'LUNCH', 2),
       ('2022-01-01', 'Бефстроганов', 'LUNCH', 2),
       ('2022-01-01', 'Морс', 'LUNCH', 2),

       ('2022-01-01', 'Гнездо глухаря', 'LUNCH', 3),
       ('2022-01-01', 'Харчо', 'LUNCH', 3),
       ('2022-01-01', 'Гречневая каша', 'LUNCH', 3),
       ('2022-01-01', 'Куриные отбивные', 'LUNCH', 3),
       ('2022-01-01', 'Компот', 'LUNCH', 3),

       ('2022-01-02', 'Сельдь под шубой', 'LUNCH', 1),
       ('2022-01-02', 'Борщ', 'LUNCH', 1),
       ('2022-01-02', 'Картофельное пюре', 'LUNCH', 1),
       ('2022-01-02', 'Шашлык из курицы', 'LUNCH', 1),
       ('2022-01-02', 'Компот', 'LUNCH', 1),

       ('2022-01-02', 'Цезарь', 'LUNCH', 2),
       ('2022-01-02', 'Щи со свежей капустой', 'LUNCH', 2),
       ('2022-01-02', 'Рис', 'LUNCH', 2),
       ('2022-01-02', 'Бефстроганов', 'LUNCH', 2),
       ('2022-01-02', 'Морс', 'LUNCH', 2),

       ('2022-01-02', 'Гнездо глухаря', 'LUNCH', 3),
       ('2022-01-02', 'Харчо', 'LUNCH', 3),
       ('2022-01-02', 'Гречневая каша', 'LUNCH', 3),
       ('2022-01-02', 'Шашлык из свинины', 'LUNCH', 3),
       ('2022-01-02', 'Компот', 'LUNCH', 3)
      ;

INSERT INTO VOTES (DATE, USER_ID, RESTAURANT_ID)
VALUES ('2022-01-01', 1, 1),
       ('2022-01-01', 2, 2),
       ('2022-01-01', 3, 2),

       ('2022-01-02', 1, 1),
       ('2022-01-01', 2, 1),
       ('2022-01-01', 3, 3)
       ;



